bash
bash-completion
bat
bison
brotli
c-ares
ca-certificates
choose-gui
cmake
cmatrix
curl
direnv
entr
exiftool
expat
eza
fd
fontconfig
freetype
fzf
gettext
gh
git-delta
gitleaks
glib
glow
gmp
gnutls
go
gum
html2text
htop
icu4c@76
icu4c@77
jpeg-turbo
jq
lazydocker
lazygit
lf
lftp
libevent
libgit2
libgpg-error
libidn2
libnghttp2
libnghttp3
libngtcp2
libpng
libssh2
libtasn1
libtiff
libunistring
libuv
libvterm
little-cms2
llvm
lpeg
lua
luajit
luarocks
luv
lz4
meson
mpdecimal
msgpack
ncdu
ncurses
neovim
nettle
ninja
node
numbat
oatmeal
oniguruma
openssl@3
p11-kit
pastel
pcre2
pipx
pkgconf
pngquant
pwgen
python-setuptools
python@3.12
python@3.13
readline
ripgrep
rtmpdump
rust
sesh
shellcheck
sketchybar
skhd
speedtest-cli
sqlite
starship
stow
tealdeer
telnet
tmux
trash-cli
tree-sitter
unbound
unibilium
utf8proc
uv
wget
xh
xz
yazi
z3
zoxide
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
zstd
