# vim: ft=ruby
tap "nikitabobko/tap"

brew "libunistring"
brew "gettext"
brew "ncurses"
brew "readline"
brew "ca-certificates"
brew "openssl@3"
brew "libssh2"
brew "libgit2"
brew "brotli"
brew "c-ares"
brew "cmake"
brew "cmatrix"
brew "libnghttp2"
brew "xz"
brew "exiftool"
brew "html2text"
brew "icu4c@76"
brew "lftp"
brew "libevent"
brew "libuv"
brew "libvterm"
brew "mpdecimal"
brew "lpeg"
brew "luajit"
brew "luarocks"
brew "luv"
brew "msgpack"

brew "caddy"
brew "redis"

brew "ncdu"
brew "lazydocker"
brew "lazygit"
brew "htop"
brew "yazi"
brew "lf"

# tap "anomalyco/tap"
# brew "opencode"

brew "neovim"
brew "tree-sitter"
brew "ripgrep"
brew "fd"
brew "entr"

# brew "lima"
# brew "docker"
# brew "docker-compose"

brew "parallel"
brew "pastel"
brew "pcre2"
brew "pipx"
brew "pkgconf"
brew "pngquant"
brew "pwgen"
brew "python@3.12"
brew "shellcheck"
brew "shfmt"
brew "prettier"
brew "speedtest-cli"
brew "telnet"
brew "uv"
brew "wget"
brew "xh"
brew "qrencode"

brew "coreutils"
brew "watch"
brew "git-lfs"

brew "go"
brew "rust"

brew "tmux"
brew "sesh"

brew "eza"
brew "jq"
brew "yq"
brew "tealdeer"
brew "bat"
brew "glow"
brew "gum"
brew "git-delta"
brew "gitleaks"
brew "gh"
brew "stow"

brew "bash"
brew "bash-completion"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "fzf"
brew "direnv"
brew "starship"

brew "choose-gui"

tap "daipeihust/tap"
brew "im-select"

tap "felixkratz/formulae"
brew "felixkratz/formulae/sketchybar"

tap "jsdelivr/globalping"
brew "globalping"

# cask "ngrok"
brew "cloudflared"

cask "aerospace"
cask "amethyst"
cask "flameshot"
cask "ghostty"
cask "qutebrowser"
cask "wezterm"
cask "gimp"

cask "claude-code"

cask "font-jetbrains-mono-nerd-font"
